Autodesk.Revit.UI.ComboBoxData.Image
The image shown on the ComboBox.
Remarks: The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.
Since: 2011

Autodesk.Revit.UI.ComboBoxData.#ctor(System.String)
Constructs a new instance of ComboBoxData.
name: The internal name of the ComboBoxMember.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for name.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for name.
Since: 2011

Autodesk.Revit.UI.ComboBoxData
This class contains information necessary to construct a combo box in the Ribbon.
Since: 2011